## Apply function:
Pandas.apply allow users to pass a function to every cell in the dataframe.
Ander conditions of the function  it works to dataframe
it makes code more readiable and easy.

DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)
fun: function you want to apply to rows or columns

axis(0 or index,1 or column)
axis:0 or 'index': apply function to each column.
axis:1 or 'column': apply function to each row.

row:(False is Default,Determines if row or column is passed as a Series or ndarray object)
if row = False :passes each row or column as a Series to the function.
else: the passed function will receive ndarray objects instead

args :tuple
Positional arguments to pass to func in addition to the array/series.


**kwargs:Additional keyword arguments to pass as keywords arguments to func.

In [16]:
import pandas as pd
import numpy as np
df3 = pd.DataFrame([[2,3,4,5]] * 3, columns=['A', 'B','C','D'])
df3

   A  B  C  D
0  2  3  4  5
1  2  3  4  5
2  2  3  4  5

In [17]:
df3.apply(np.sqrt)

          A         B    C         D
0  1.414214  1.732051  2.0  2.236068
1  1.414214  1.732051  2.0  2.236068
2  1.414214  1.732051  2.0  2.236068

In [18]:
#the same as np.sqrt(df3)
np.sqrt(df3)

          A         B    C         D
0  1.414214  1.732051  2.0  2.236068
1  1.414214  1.732051  2.0  2.236068
2  1.414214  1.732051  2.0  2.236068

In [19]:
#sum each column alone so you will get 4 values 
df3.apply(np.sum,axis = 0)

A     6
B     9
C    12
D    15
dtype: int64

In [20]:
#sum all row so you will get 3 rows 
df3.apply(np.sum,axis = 1)

0    14
1    14
2    14
dtype: int64

In [21]:
import pandas as pd
df = pd.read_csv('traffic.csv')
df.head()

,state,stop_date,stop_time,county_name,driver_gender,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop,district
0,RI,2005-01-04,12:55,NaN,M,White,Equipment/Inspection Violation,Equipment,False,NaN,Citation,False,0-15 Min,False,Zone X4
1,RI,2005-01-23,23:15,NaN,M,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False,Zone K3
2,RI,2005-02-17,04:15,NaN,M,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False,Zone X4
3,RI,2005-02-20,17:15,NaN,M,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False,Zone X1
4,RI,2005-02-24,01:20,NaN,F,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False,Zone X3

In [22]:
def use_apply(i):
        j = "NotFound"
        if i == 'M':
            j ="Male"
        elif i == "F":
            j = "Female"
        
        return j
      
result = df['driver_gender'].apply(use_apply)
result

0          Male
1          Male
2          Male
3          Male
4        Female
          ...
91736    Female
91737    Female
91738      Male
91739    Female
91740      Male
Name: driver_gender, Length: 91741, dtype: object

As we see above we shange every cell in column driver_gender as function said

## pandas.DataFrame.agg
This Function help you to do some operations at the same time so reduce your code.

DataFrame.agg(func=None, axis=0, *args, **kwargs)
func : accept functions to perform them this function accept list of funtions 

axis: defult 0 to perform along columns 
axis :1 to perform along rows 

*args: to add some parameters 

**kwargs:Keyword arguments to pass to func to name identify parameters

In [27]:
df3 = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan],
                    [3,4,5],
                    [8,9,6]],
                  columns=['A', 'B', 'C'])
df3.agg(['max','sum'])

        A     B     C
max   8.0   9.0   9.0
sum  23.0  28.0  29.0

In [28]:
df3.agg(sum)

A    23.0
B    28.0
C    29.0
dtype: float64

In [29]:
df3.agg(min)

A    1.0
B    2.0
C    3.0
dtype: float64

## Merge Dataframe
If Y;ou have To Data sets and  you want to Work at them at the same time to get results from them all you should use merge 
Its style off join at dataframe 
pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

left:Dataframe 

right:the second dataframe 

how:(inner defult,outer,left ,right,cross)
left:use keys frrom left data frame 
right:use keys frrom right data frame 
inner: intersection between the two data frame
outer:the union of the two data frame

on:column name which should be in the two data Frame

left_on:Column or index level names to join on in the left DataFrame.

right_on:Column or index level names to join on in the right DataFrame.

left_index:default false ,use index of the left dataframe

right_index:use index of the right dataframe

suffixes:to distingush between two data frame columns if there exist the same names

In [36]:
df4 = pd.DataFrame({'dfk': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df5 = pd.DataFrame({'dfk': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
pd.merge(df4,df5,on ='dfk') # intersection

   dfk  value_x  value_y
0  foo        1        5
1  foo        1        8
2  foo        5        5
3  foo        5        8
4  bar        2        6
5  baz        3        7

In [38]:
pd.merge(df4,df5,how = 'outer' ,on = 'dfk')

   dfk  value_x  value_y
0  foo        1        5
1  foo        1        8
2  foo        5        5
3  foo        5        8
4  bar        2        6
5  baz        3        7

In [39]:
df4.merge(df5,how = 'cross') # cross product

   dfk_x  value_x dfk_y  value_y
0    foo        1   foo        5
1    foo        1   bar        6
2    foo        1   baz        7
3    foo        1   foo        8
4    bar        2   foo        5
5    bar        2   bar        6
6    bar        2   baz        7
7    bar        2   foo        8
8    baz        3   foo        5
9    baz        3   bar        6
10   baz        3   baz        7
11   baz        3   foo        8
12   foo        5   foo        5
13   foo        5   bar        6
14   foo        5   baz        7
15   foo        5   foo        8

## pandas.isnull
catch Empty cells and Return True if NaN and False if not

In [40]:
df3.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3   True   True   True
4  False  False  False
5  False  False  False

## pandas.unique(values)
return unique values

In [44]:
pd.unique(pd.Series([4,5,7,8,9,99,4,5,4 ,2,33]))# notice that the output not sorted

array([ 4,  5,  7,  8,  9, 99,  2, 33], dtype=int64)

In [46]:
pd.unique([("m", "n"), ("z", "x"), ("n", "v"), ("z", "x")]) # note that (a,b) != (b,a)

array([('m', 'n'), ('z', 'x'), ('n', 'v')], dtype=object)

## melt in pandas 
used to change Data formate from wide-----> to long(⬇️)

In [53]:

d1 = {"Name": ["Aya", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

print(df)
print('\n________________________________________\n')

df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"])

print(df_melted)

    Name  ID    Role
0    Aya   1     CEO
1   Lisa   2  Editor
2  David   3  Author

________________________________________

   ID variable   value
0   1     Name     Aya
1   2     Name    Lisa
2   3     Name   David
3   1     Role     CEO
4   2     Role  Editor
5   3     Role  Author

we can use pivot to unmelt dataframe

In [78]:
d1 = {"Name": ["Aya", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

print(df)
print('\n________________________________________\n')

melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"], var_name="Attribute", value_name="Value")

print(melted)
print('\n________________________________________\n')

# unmelting using pivot()

unmelted = melted.pivot(index='ID', columns='Attribute')

print(unmelted)

    Name  ID    Role
0    Aya   1     CEO
1   Lisa   2  Editor
2  David   3  Author

________________________________________

   ID Attribute   Value
0   1      Name     Aya
1   2      Name    Lisa
2   3      Name   David
3   1      Role     CEO
4   2      Role  Editor
5   3      Role  Author

________________________________________

           Value
Attribute   Name    Role
ID
1            Aya     CEO
2           Lisa  Editor
3          David  Author

In [75]:
unmelted = unmelted['Value'].reset_index()
unmelted.columns.name = None
print(unmelted)

   ID   Name    Role
0   1    Aya     CEO
1   2   Lisa  Editor
2   3  David  Author